public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");

        // ①勇者は、誕⽣したらプレーヤーから名前を与えられる。（くろだい）
        // heroインスタンスにHPと名前をセット
        // Hero hero = new Hero(100, "小藪");

        // ②勇者は、最初に、王様に会いに⾏き、使命を与えられる。（くろだい）
        // kingのコンストラクタでprintlnするだけ
        // King king = new King();

        // ④旅の途中で、敵に出会う。（くろだい）
        // ランダムで敵クラスをnewする

        // ⑤敵に出会った場合、勇者がどう⾏動するかは、プレーヤーが決める。（澤村）

        // ⑥各キャラクターが攻撃を⾏った場合、敵にどの程度のダメージを与えることが出来るかは、乱数できまる。（澤村）

        // ⑦旅の途中で、魔法使いに出会う。（澤村）

        // ⑧スライム、ゴブリン、狼男を全て倒し、魔法使いと仲間になると、勇者は、スーパー勇者になる。（澤村）

        // ⑨スーパー勇者になったあと、再び旅に出る。（澤村）

        // ⑩旅の途中で、敵に出会う。（澤村）

        // ⑪魔王と戦って、勝つことが出来れば、お姫様を救うことが出来る。（澤村）

        // ⑫お姫様から、感謝の⾔葉をもらい、使命は完了して、ゲームは終了する。（くろだい）
        // printlnしてexit
    }
}